000100 IDENTIFICATION DIVISION.
000200  PROGRAM-ID. SAMPLE4.
000300*
000400 ENVIRONMENT DIVISION.
000500  CONFIGURATION SECTION.
000600  SPECIAL-NAMES.
000700      CRT STATUS  IS  SCREEN-STATUS.
000800  INPUT-OUTPUT SECTION.
000900  FILE-CONTROL.
001000      SELECT    INDEXED-FILE
001100                ASSIGN       TO  OUTFILE
001200                ORGANIZATION IS  INDEXED
001300                RECORD KEY   IS  ID-NUMBER
001400                ALTERNATE RECORD KEY IS NAME-VALUE
001500                ACCESS MODE  IS  RANDOM.
001600*
001700 DATA DIVISION.
001800  FILE SECTION.
001900  FD   INDEXED-FILE.
002000  01   INDEXED-RECORD.
002100       02  ID-NUMBER     PIC 9(6).
002200       02  NAME-VALUE    PIC X(40).
002300*
002400  WORKING-STORAGE SECTION.
002500  01  SCREEN-STATUS.
002600    02  STATUS-KEY.
002700      03  STATUS-KEY-1       PIC X.
002800      03  STATUS-KEY-2       PIC X.
002900    02                       PIC X.
003000*
003100  CONSTANT SECTION.
003200  01  PF2-KEY.
003300    02                       PIC X    VALUE "1".
003400    02                       PIC X    VALUE X"02".
003500*
003600  SCREEN SECTION.
003700  01  DISP-SCR BLANK SCREEN BACKGROUND-COLOR IS 7
003800                            FOREGROUND-COLOR IS 0.
003900    02                LINE  5 COLUMN 13 VALUE "ID-NUMBER:".
004000    02  ID-NUMBER-AREA  LINE  5 COLUMN 25 FOREGROUND-COLOR IS 1 PIC X(6) TO ID-NUMBER AUTO.
004100    02                LINE 10 COLUMN 13 VALUE "NAME:".
004200    02  NAME-AREA     LINE 10 COLUMN 20 FOREGROUND-COLOR IS 1 PIC X(40)  TO NAME-VALUE AUTO.
004300    02  KEY-DSC-AREA  LINE 18 COLUMN 30 FOREGROUND-COLOR IS 4 VALUE "PF2:TERM".
004400*
004500 PROCEDURE DIVISION.
004600*
004700      OPEN OUTPUT INDEXED-FILE.
004800*
004900  LOOP-POINT.
005000**
005100      DISPLAY DISP-SCR.
005200** INPUT DATA.
005300      ACCEPT DISP-SCR.
005400      IF STATUS-KEY = PF2-KEY THEN GO TO TERM-PROC.
005500** OUTPUT RECORD.
005600      WRITE INDEXED-RECORD.
005700      GO TO LOOP-POINT.
005800*
005900  TERM-PROC.
006000      CLOSE INDEXED-FILE.
006100      EXIT PROGRAM.
006200  END PROGRAM SAMPLE4.
