000100 IDENTIFICATION DIVISION.
000200  PROGRAM-ID. SAMPLE2.
000300*
000400 ENVIRONMENT DIVISION.
000500  INPUT-OUTPUT SECTION.
000600   FILE-CONTROL.
000700     SELECT DATA-FILE
000800         ASSIGN       TO  infile
000900         ORGANIZATION IS  LINE SEQUENTIAL.
001000     SELECT INDEXED-FILE
001100         ASSIGN       TO  OUTFILE
001200         ORGANIZATION IS  INDEXED
001300         RECORD KEY   IS  GOODS-CODE  OF  INDEXED-RECORD
001400         ALTERNATE RECORD KEY IS  GOODS-NAME  OF  INDEXED-RECORD
001500         ACCESS MODE  IS  SEQUENTIAL.
001600*
001700 DATA DIVISION.
001800  FILE SECTION.
001900  FD  DATA-FILE.
002000  01  DATA-RECORD.
002100      02  GOODS-RECORD.
002200          03  GOODS-CODE    PIC X(4).
002300          03                PIC X.
002400          03  GOODS-NAME    PIC X(38).
002500          03                PIC X.
002600          03  GOODS-PRICE   PIC 9(4).
002700  FD  INDEXED-FILE.
002800  01  INDEXED-RECORD.
002900      02  GOODS-RECORD.
003000          03  GOODS-CODE    PIC X(4).
003100          03  GOODS-NAME    PIC X(38).
003200          03  GOODS-PRICE   PIC 9(4)  BINARY.
003300*
003400 PROCEDURE DIVISION.
003500**(1) OPEN THE INPUT (LINE SEQUENTIAL) FILE.
003600      OPEN INPUT  DATA-FILE.
003700      OPEN OUTPUT INDEXED-FILE.
003800*
003900  LOOP-POINT.
004000**(2) OUTPUT AN INDEXED FILE FROM THE RECORDS READ FROM
004100**THE LINE SEQUENTIAL FILE.
004200**
004300      READ DATA-FILE AT END GO TO TERM-PROC.
004400      MOVE CORR DATA-RECORD TO INDEXED-RECORD.
004500      WRITE INDEXED-RECORD.
004600      GO TO LOOP-POINT.
004700*
004800  TERM-PROC.
004900**(3) CLOSE THE OUTPUT FILE.
005000      CLOSE  DATA-FILE INDEXED-FILE.
005100 END PROGRAM SAMPLE2.
