000100 IDENTIFICATION DIVISION.
000200  PROGRAM-ID. SAMPLE6.
000300*
000400 ENVIRONMENT DIVISION.
000500  CONFIGURATION SECTION.
000600  SPECIAL-NAMES.
000700     ARGUMENT-NUMBER IS ARG-NO
000800     ARGUMENT-VALUE  IS ARG-VAL.
000900*
001000 DATA DIVISION.
001100 WORKING-STORAGE SECTION.
001200   01  NO-ARG      PIC 9(4)  BINARY.
001300   01  DIFF-DAYS    PIC S9(5) DISPLAY.
001400*
001500   01  TOTAL-DAYS1 PIC S9(8) BINARY.
001600   01  ARG1.
001700     02  YYMMDD1.
001800         03  YY   PIC 99.
001900         03  MM   PIC 99.
002000         03  DD   PIC 99.
002100     02  DATE-INF1  REDEFINES YYMMDD1  PIC X(6).
002200*
002300   01  TOTAL-DAYS2    PIC S9(8) BINARY.
002400   01  ARG2.
002500     02  YYMMDD2.
002600         03  YY  PIC 99.
002700         03  MM  PIC 99.
002800         03  DD  PIC 99.
002900     02  DATE-INF2  REDEFINES YYMMDD2  PIC X(6).
003000*
003100 PROCEDURE DIVISION.
003200     ACCEPT NO-ARG FROM ARG-NO.
003300     IF NO-ARG NOT = 2 THEN
003400       DISPLAY "NUMBER OF ARGUMENT IS INVALID"
003500       GO TO TERM-PROC
003600     END-IF
003700*
003800     ACCEPT DATE-INF1 FROM ARG-VAL.
003900     ACCEPT DATE-INF2 FROM ARG-VAL.
004000     CALL "SUMCALC"  USING YYMMDD1 TOTAL-DAYS1.
004100     CALL "SUMCALC"  USING YYMMDD2 TOTAL-DAYS2.
004200*
004300     COMPUTE DIFF-DAYS = TOTAL-DAYS2 - TOTAL-DAYS1.
004400     DISPLAY "DIFFERENCE OF DAYS IS " DIFF-DAYS.
004500*
004600 TERM-PROC.
004700     EXIT PROGRAM.
004800*
004900/
005000*  COMPUTE THE TOTAL DAYS FROM 1/1/1900
005100 IDENTIFICATION DIVISION.
005200   PROGRAM-ID. SUMCALC  INITIAL PROGRAM.
005300*
005400 DATA DIVISION.
005500 WORKING-STORAGE SECTION.
005600   77  TOTAL-DAYS  PIC S9(8) BINARY.
005700   77  CTR         PIC S9(4) BINARY.
005800   77  LEAP-YEAR   PIC S9(8) BINARY.
005900   77  WORK-YEAR   PIC S9(4) BINARY.
006000   77  REM         PIC S9(4) BINARY.
006100   01  MMDD-TABLE.
006200      02  DAYS     PIC X(24)
006300                   VALUE  "312831303130313130313031".
006400      02  MMDD     REDEFINES DAYS
006500                   PIC 99 OCCURS 12 TIMES.
006600*
006700 LINKAGE SECTION.
006800   01  INPUT-DATE.
006900         03  YY  PIC 99.
007000         03  MM  PIC 99.
007100         03  DD PIC 99.
007200   01  OUTPUT-DAYS  PIC S9(8)  BINARY.
007300*
007400 PROCEDURE DIVISION  USING INPUT-DATE OUTPUT-DAYS.
007500**
007600**(1) COMPUTE THE TOTAL NUMBER OF DAYS FROM LAST YEAR.
007700     COMPUTE TOTAL-DAYS = YY * 365.
007800*
007900* COMPUTE LEAP YEARS, IF ANY.
008000     COMPUTE LEAP-YEAR  = (YY - 1) / 4.
008100     COMPUTE TOTAL-DAYS = TOTAL-DAYS + LEAP-YEAR.
008200**
008300**(2) DETERMINE THE NUMBER OF DAYS IN FEBRUARY.
008400     DIVIDE YY BY 4  GIVING WORK-YEAR REMAINDER REM.
008500     IF REM = 0 THEN
008600       MOVE "29" TO MMDD(2)
008700     END-IF.
008800**
008900**(3) COMPUTE THE NUMBER OF DAYS IN THE YEAR.
009000     PERFORM  VARYING CTR FROM 1 BY 1 UNTIL CTR = MM
009100       COMPUTE TOTAL-DAYS = TOTAL-DAYS + MMDD(CTR)
009200     END-PERFORM.
009300**
009400**
009500     COMPUTE OUTPUT-DAYS = TOTAL-DAYS + DD.
009600**
009700     EXIT PROGRAM.
009800 END PROGRAM  SUMCALC.
009900 END PROGRAM  SAMPLE6.