000100 IDENTIFICATION DIVISION.
000200  PROGRAM-ID. SAMPLE8.
000300*
000400 ENVIRONMENT DIVISION.
000500  INPUT-OUTPUT SECTION.
000600   FILE-CONTROL.
000700     SELECT PRINT-FILE
000800         ASSIGN       TO  PRINTER.
000900*
001000 DATA DIVISION.
001100  FILE SECTION.
001200  FD  PRINT-FILE.
001300  01  PRINT-RECORD      PIC X(40).
001400*
001500 PROCEDURE DIVISION.
001600**(1)OPEN THE PRINT-FILE.
001700      OPEN OUTPUT PRINT-FILE.
001800*
001900  LOOP-POINT.
002200      ACCEPT PRINT-RECORD FROM CONSOLE.
002300      IF PRINT-RECORD(1:5) = "/END "
002400        GO TO TERM-PROC.
002500      WRITE PRINT-RECORD.
002600      GO TO LOOP-POINT.
002700*
002800  TERM-PROC.
003000      CLOSE  PRINT-FILE.
003100 END PROGRAM SAMPLE8.
