000100 IDENTIFICATION DIVISION.
000200  PROGRAM-ID. SAMPLE7.
000300*
000400 ENVIRONMENT DIVISION.
000500*
000600  CONFIGURATION SECTION.
000700  SPECIAL-NAMES.
000800     ENVIRONMENT-NAME  IS ENV-NAME
000900     ENVIRONMENT-VALUE IS ENV-VAL.
001000*
001100  INPUT-OUTPUT SECTION.
001200  FILE-CONTROL.
001300       SELECT OLD-MASTER-FILE
001400         ASSIGN TO INFILE
001500         ORGANIZATION IS INDEXED
001600         RECORD KEY IS GOODS-CODE OF OLD-MASTER-RECORD
001700         ALTERNATE RECORD KEY IS GOODS-NAME OF OLD-MASTER-RECORD
001800         ACCESS MODE IS SEQUENTIAL.
001900       SELECT NEW-MASTER-FILE
002000         ASSIGN TO OUTFILE
002100         ORGANIZATION IS INDEXED
002200         RECORD KEY IS GOODS-CODE OF NEW-MASTER-FILE
002300         ALTERNATE RECORD KEY IS GOODS-NAME OF NEW-MASTER-RECORD
002400         ACCESS MODE IS SEQUENTIAL.
002500*
002600 DATA DIVISION.
002700*
002800  FILE SECTION.
002900  FD OLD-MASTER-FILE.
003000  01 OLD-MASTER-RECORD.
003100     02  GOODS-RECORD.
003200         03 GOODS-CODE    PIC X(4).
003300         03 GOODS-NAME    PIC X(38).
003400         03 GOODS-PRICE   PIC 9(4) BINARY.
003500  FD NEW-MASTER-FILE.
003600  01 NEW-MASTER-RECORD.
003700     02  GOODS-RECORD.
003800         03 GOODS-CODE    PIC X(4).
003900         03 GOODS-NAME    PIC X(38).
004000         03 GOODS-PRICE   PIC 9(4) BINARY.
004100  WORKING-STORAGE SECTION.
004200  01  FILE-NAME   PIC X(100).
004300  01  OLD-FILE-NAME PIC X(100).
004400  01  NEW-FILE-NAME-SUF1  PIC X(2) VALUE ".a".
004500  01  NEW-FILE-NAME-SUF2  PIC X(2) VALUE ".b".
004600*
004700 PROCEDURE DIVISION.
004800*
004900**(1)GET THE OLD-MASTER-FILE NAME
005000      MOVE SPACE TO OLD-FILE-NAME.
005100      DISPLAY "INFILE" UPON ENV-NAME.
005200      ACCEPT OLD-FILE-NAME FROM ENV-VAL
005300                        ON EXCEPTION GO TO TERM-PROC
005400      END-ACCEPT.
005500*
005600**(2)GENERATE A NEW-MASTER-FILE1.
005700      MOVE SPACE TO FILE-NAME.
005800      STRING OLD-FILE-NAME NEW-FILE-NAME-SUF1 DELIMITED BY " "
005900        INTO FILE-NAME.
006000      DISPLAY "OUTFILE" UPON ENV-NAME.
006100      DISPLAY FILE-NAME UPON ENV-VAL.
006200      OPEN OUTPUT NEW-MASTER-FILE.
006300      OPEN INPUT OLD-MASTER-FILE.
006400      START OLD-MASTER-FILE FIRST RECORD.
006500*
006600 OLD-FILE-INPROC1.
006700      READ OLD-MASTER-FILE AT END GO TO FILE1-TERM-PROC.
006800        IF GOODS-CODE OF OLD-MASTER-RECORD(1:1) = "0" THEN
006900          MOVE OLD-MASTER-RECORD TO NEW-MASTER-RECORD
007000          WRITE NEW-MASTER-RECORD
007100        END-IF.
007200      GO TO OLD-FILE-INPROC1.
007300 FILE1-TERM-PROC.
007400      CLOSE OLD-MASTER-FILE NEW-MASTER-FILE.
007500*
007600**(3)GENERATE A NEW-MASTER-FILE2.
007700      MOVE SPACE TO FILE-NAME.
007800      STRING OLD-FILE-NAME NEW-FILE-NAME-SUF2 DELIMITED BY " "
007900        INTO FILE-NAME.
008000      DISPLAY "OUTFILE" UPON ENV-NAME.
008100      DISPLAY FILE-NAME UPON ENV-VAL.
008200      OPEN OUTPUT NEW-MASTER-FILE
008300      OPEN INPUT OLD-MASTER-FILE.
008400      START OLD-MASTER-FILE FIRST RECORD.
008500*
008600 OLD-FILE-INPROC2.
008700      READ OLD-MASTER-FILE AT END GO TO FILE2-TERM-PROC.
008800        IF GOODS-CODE OF OLD-MASTER-RECORD(1:1) NOT = "0" THEN
008900          MOVE OLD-MASTER-RECORD TO NEW-MASTER-RECORD
009000          WRITE NEW-MASTER-RECORD
009100        END-IF.
009200      GO TO OLD-FILE-INPROC2.
009300 FILE2-TERM-PROC.
009400      CLOSE OLD-MASTER-FILE NEW-MASTER-FILE.
009500*
009600**(4)END THE PROGRAM.
009700 TERM-PROC.
009800      EXIT PROGRAM.
009900 END PROGRAM SAMPLE7.
