000010 IDENTIFICATION DIVISION.
000020  PROGRAM-ID. COBDLL.
000030* 
000040 DATA DIVISION.
000050  WORKING-STORAGE SECTION.
000060 LINKAGE SECTION.
000070 01 OUT-NUMBER PIC S9(9) COMP-5.
000080 PROCEDURE DIVISION WITH STDCALL LINKAGE USING OUT-NUMBER.
000090     MOVE 905  TO OUT-NUMBER.
000100     EXIT PROGRAM.