000100  01  STATUS-AREA.
000200      02  ERR-CODE          PIC S9(9) COMP-5.
000300      02  DETAIL-CODE       PIC S9(9) COMP-5.
000400  01  SERVER-NAME           PIC X(15).
000500  01  SERVER-ID             PIC S9(9) COMP-5.
000600  01  LOGICAL-DESTINATION   PIC X(8).
000700  01  RECIVE-PARAM.
000800      02  BUFFER-LEN        PIC S9(9) COMP-5.
000900      02  MSG-LEN           PIC S9(9) COMP-5.
001000      02  PROC-KIND         PIC S9(9) COMP-5.
001100      02  WAIT-TIME         PIC S9(9) COMP-5.
001200      02                    PIC X(16) VALUE LOW-VALUE.
001300  01  TRANSMIT-PARAM.
001400      02  MSG-LEN           PIC S9(9) COMP-5.
001500      02  PRIORITY          PIC S9(9) COMP-5.
001600      02  PROC-KIND         PIC S9(9) COMP-5.
001700      02  WAIT-TIME         PIC S9(9) COMP-5.
001800      02                    PIC X(16) VALUE LOW-VALUE.
001900  01  COMM-RESERVED         PIC S9(9) COMP-5 VALUE 0.
