000100 IDENTIFICATION DIVISION.
000200  PROGRAM-ID. SAMPLE9.
000300*
000400 DATA DIVISION.
000500  WORKING-STORAGE SECTION.
000600      COPY "PRM_REC.CBL".
000700*
000800  01  MSG-AREA.
000900      02  COMM-AREA  OCCURS 1 TO 32000 DEPENDING ON MSG-LEN-W.
001000          03              PIC X(1).
001100  01  MSG-LEN-W           PIC 9(5).
001200  01  TRANSMIT-MSG1       PIC X(25) VALUE "MESSAGE SENT FROM SAMPLE9".
001200  01  TRANSMIT-MSG2       PIC X(25) VALUE "MESSAGE SENT : PRIORITY=5".
001300*
001400 PROCEDURE DIVISION.
001500** CONNECT TO THE SERVER
001600      MOVE "SERVER1" TO SERVER-NAME.
001700      CALL "COBCI_OPEN" WITH C LINKAGE
001800           USING BY REFERENCE STATUS-AREA
001900                 BY REFERENCE SERVER-NAME
002000                 BY REFERENCE SERVER-ID
002100                 BY VALUE     COMM-RESERVED.
002200      IF PROGRAM-STATUS = 0
002300           DISPLAY "CONNECTION TO THE SERVER SUCCEEDED."
002400           DISPLAY "  SERVER-NAME      : " SERVER-NAME
002500      ELSE
002600           DISPLAY "CONNECTION TO THE SERVER FAILED."
002700           DISPLAY "  SERVER-NAME      : " SERVER-NAME
002800           DISPLAY "  ERR-CODE         : " ERR-CODE    OF STATUS-AREA
002900           DISPLAY "  DETAIL-CODE      : " DETAIL-CODE OF STATUS-AREA
003000           GO TO EXIT-PROC.
003100*
003200** THE MESSAGE WRITE LOGICAL-DESTINATION ON SERVER
003300      MOVE 25            TO MSG-LEN-W.
003400      MOVE TRANSMIT-MSG1 TO MSG-AREA.
003500      MOVE "MYLD1"       TO LOGICAL-DESTINATION.
003600      MOVE MSG-LEN-W     TO MSG-LEN   OF TRANSMIT-PARAM.
003700      MOVE 1             TO PRIORITY  OF TRANSMIT-PARAM.
003800      MOVE 0             TO PROC-KIND OF TRANSMIT-PARAM.
003900      CALL "COBCI_WRITE" WITH C LINKAGE
004000           USING BY REFERENCE STATUS-AREA
004100                 BY VALUE     SERVER-ID
004200                 BY REFERENCE LOGICAL-DESTINATION
004300                 BY REFERENCE TRANSMIT-PARAM
004400                 BY REFERENCE MSG-AREA
004500                 BY VALUE     COMM-RESERVED.
004600      IF PROGRAM-STATUS = 0
004700           DISPLAY "A MESSAGE HAS BEEN WRITTEN."
004800           DISPLAY "  LOGICAL-DESTINATION   : " LOGICAL-DESTINATION
004900      ELSE
005000           DISPLAY "A  MESSAGE FAILED TO BE WRITTEN."
005100           DISPLAY "  LOGICAL-DESTINATION   : " LOGICAL-DESTINATION
005200           DISPLAY "  ERR-CODE         : " ERR-CODE    OF STATUS-AREA
005300           DISPLAY "  DETAIL-CODE      : " DETAIL-CODE OF STATUS-AREA.
005400*
005500      MOVE 25            TO MSG-LEN-W.
005600      MOVE TRANSMIT-MSG2 TO MSG-AREA.
005700      MOVE "MYLD1"       TO LOGICAL-DESTINATION.
005800      MOVE MSG-LEN-W     TO MSG-LEN   OF TRANSMIT-PARAM.
005900      MOVE 5             TO PRIORITY  OF TRANSMIT-PARAM.
006000      MOVE 0             TO PROC-KIND OF TRANSMIT-PARAM.
006100      CALL "COBCI_WRITE" WITH C LINKAGE
006200           USING BY REFERENCE STATUS-AREA
006300                 BY VALUE     SERVER-ID
006400                 BY REFERENCE LOGICAL-DESTINATION
006500                 BY REFERENCE TRANSMIT-PARAM
006600                 BY REFERENCE MSG-AREA
006700                 BY VALUE     COMM-RESERVED.
006800      IF PROGRAM-STATUS = 0
006900           DISPLAY "A MESSAGE HAS BEEN WRITTEN."
007000           DISPLAY "  DESTINATION      : " LOGICAL-DESTINATION
007100      ELSE
007200           DISPLAY "A  MESSAGE FAILED TO BE WRITTEN."
007300           DISPLAY "  DESTINATION      : " LOGICAL-DESTINATION
007400           DISPLAY "  ERR-CODE         : " ERR-CODE    OF STATUS-AREA
007500           DISPLAY "  DETAIL-CODE      : " DETAIL-CODE OF STATUS-AREA.
007600      DISPLAY "*** EXECUTE COMMU.EXE ***".
007700*
007800** THE MESSAGE CAN BE READ FROM THE LOGICAL-DESTINATION ON THE SERVER (WAIT TIME = 60SEC)
007900      MOVE "MYLD2" TO LOGICAL-DESTINATION.
008000      MOVE 32000   TO BUFFER-LEN OF RECIVE-PARAM.
008100      MOVE 1       TO PROC-KIND  OF RECIVE-PARAM.
008200      MOVE 60      TO WAIT-TIME  OF RECIVE-PARAM.
008300      CALL "COBCI_READ" WITH C LINKAGE
008400           USING BY REFERENCE STATUS-AREA
008500                 BY VALUE     SERVER-ID
008600                 BY REFERENCE LOGICAL-DESTINATION
008700                 BY REFERENCE RECIVE-PARAM
008800                 BY REFERENCE MSG-AREA
008900                 BY VALUE     COMM-RESERVED.
009000      IF PROGRAM-STATUS = 0
009100           DISPLAY "A MESSAGE HAS BEEN RECEIVED."
009200           DISPLAY "  DESTINATION      : " LOGICAL-DESTINATION
009300           MOVE MSG-LEN OF RECIVE-PARAM TO MSG-LEN-W
009400           DISPLAY "  MESSAGE RECEIVED : " MSG-AREA
009500      ELSE
009600           DISPLAY "A  MESSAGE FAILED TO BE RECEIVED."
009700           DISPLAY "  DESTINATION      : " LOGICAL-DESTINATION
009800           DISPLAY "  ERR-CODE         : " ERR-CODE    OF STATUS-AREA
009900           DISPLAY "  DETAIL-CODE      : " DETAIL-CODE OF STATUS-AREA.
010000*
010100      MOVE "MYLD1" TO LOGICAL-DESTINATION.
010200      MOVE 32000   TO BUFFER-LEN OF RECIVE-PARAM.
010300      MOVE 1       TO PROC-KIND  OF RECIVE-PARAM.
010400      MOVE 10      TO WAIT-TIME  OF RECIVE-PARAM.
010500      CALL "COBCI_READ" WITH C LINKAGE
010600           USING BY REFERENCE STATUS-AREA
010700                 BY VALUE     SERVER-ID
010800                 BY REFERENCE LOGICAL-DESTINATION
010900                 BY REFERENCE RECIVE-PARAM
011000                 BY REFERENCE MSG-AREA
011100                 BY VALUE     COMM-RESERVED.
011200      IF PROGRAM-STATUS = 0
011300           DISPLAY "A MESSAGE HAS BEEN RECEIVED."
011400           DISPLAY "  DESTINATION      : " LOGICAL-DESTINATION
011500           MOVE MSG-LEN OF RECIVE-PARAM TO MSG-LEN-W
011600           DISPLAY "  MESSAGE RECEIVED : " MSG-AREA
011700      ELSE
011800           DISPLAY "A  MESSAGE FAILED TO BE RECEIVED."
011900           DISPLAY "  DESTINATION      : " LOGICAL-DESTINATION
012000           DISPLAY "  ERR-CODE         : " ERR-CODE    OF STATUS-AREA
012100           DISPLAY "  DETAIL-CODE      : " DETAIL-CODE OF STATUS-AREA.
012200*
012300      CALL "COBCI_READ" WITH C LINKAGE
012400           USING BY REFERENCE STATUS-AREA
012500                 BY VALUE     SERVER-ID
012600                 BY REFERENCE LOGICAL-DESTINATION
012700                 BY REFERENCE RECIVE-PARAM
012800                 BY REFERENCE MSG-AREA
012900                 BY VALUE     COMM-RESERVED.
013000      IF PROGRAM-STATUS = 0
011300           DISPLAY "A MESSAGE HAS BEEN RECEIVED."
013200           DISPLAY "  DESTINATION      : " LOGICAL-DESTINATION
013300           MOVE MSG-LEN OF RECIVE-PARAM TO MSG-LEN-W
011600           DISPLAY "  MESSAGE RECEIVED : " MSG-AREA
013500      ELSE
011800           DISPLAY "A  MESSAGE FAILED TO BE RECEIVED."
013700           DISPLAY "  DESTINATION      : " LOGICAL-DESTINATION
013800           DISPLAY "  ERR-CODE         : " ERR-CODE OF STATUS-AREA
013900           DISPLAY "  DETAIL-CODE      : " DETAIL-CODE OF STATUS-AREA.
014000*
014100** DISCONNECT WITH SERVER
014200      CALL "COBCI_CLOSE" WITH C LINKAGE
014300           USING BY REFERENCE STATUS-AREA
014400                 BY VALUE     SERVER-ID
014500                 BY VALUE     COMM-RESERVED.
014600      IF PROGRAM-STATUS = 0
014700           DISPLAY "DISCONNECTION FROM THE SERVER SUCCEEDED."
014800           DISPLAY "  SERVER-NAME      : " SERVER-NAME
014900      ELSE
015000           DISPLAY "DISCONNECTION FROM THE SERVER FAILED."
015100           DISPLAY "  SERVER-NAME      : " SERVER-NAME
015200           DISPLAY "  ERR-CODE: " ERR-CODE OF STATUS-AREA
015300           DISPLAY "  DETAIL-CODE      : " DETAIL-CODE OF STATUS-AREA.
015400*
015500 EXIT-PROC.
015600     EXIT PROGRAM.
015700 END PROGRAM SAMPLE9.
