  *>  THIS LIBRARY TEXT IS DESCRIBED BY FREE FORMAT OF REFERENCE FORMAT.
 02  GOODS-RECORD.
     03  GOODS-CODE      PIC X(4).
     03                  PIC X(1).
     03  GOODS-NAME      PIC X(38).
     03                  PIC X(1).
     03  GOODS-PRICE     PIC 9(4)  DISPLAY.
